[
    {
        "date": "2025-8-10",
        "title": "Puzuri Begins Soya Outgrower Training with Enthusiastic Farmers in Adaklu District",
        "slug": "puzuri-begins-soya-outgrower-training-with-enthusiastic-farmers-in-segbale",
        "teaser": "In a significant step toward sustainable agricultural transformation in the Volta Region, Puzuri Agro Company Limited, a subsidiary of Puzuri Group of Companies Limited has officially launched its Soya Outgrower Scheme with a spirited community engagement and the first Good Agricultural Practices (GAP) training session in Segbale, Adaklu Sofa, Adaklu Hlihave, Blido Kope, in Adaklu Ahunda Boso.",
        "poster": "/news/images/outgrowers.jpg",
        "thumbnail" : "/news/thumbnails/test.jpg",
        "main_category": "agro",
        "tags": [],
        "blocks" : [
           {
            "type" : "paragraph",
            "content" : "The activity marks the beginning of a new season of productivity and partnership between Puzuri and over 500 selected smallholder farmers (SHFs) from these communities."
        },


        {
            "type" : "image",
            "src" : "/news/images/outgrowers_3.jpg",
            "size" : "contain"
        },



        {
            "type" : "paragraph",
            "content" : "The event kicked off with an open-air orientation session led by the Puzuri project team. Community elders, youth representatives, and women leaders were in attendance. The session introduced farmers to the full scope of the outgrower scheme, including the distribution of certified soya seeds, pre-emergence herbicides, ploughing support, and access to extension services throughout the season."
        },



        {
            "type" : "paragraph",
            "content" : "In addition to the technical training on sustainable and climate-smart cultivation methods, a major highlight of the engagement was the contract briefing. Farmers were guided through the contents of the agreement, which outlines mutual obligations such as timely planting, input usage, produce recovery, and post-harvest handling protocols. Puzuri’s innovative model ensures that the farmers retain ownership of their crops while benefiting from a ready market and technical support."
        },


        {
            "type" : "paragraph",
            "content" : "Beyond individual gains, the project is designed to deliver broader socio-economic benefits. Participating farmers will not only increase their household incomes but also contribute to community-wide food security and national production targets. With an expected average yield of 700kg per acre and a fair market recovery system, this initiative is projected to inject vibrancy into the rural economy of Segbale and surrounding areas."
        },


        {
            "type" : "image",
            "src" : "/news/images/outgrowers_2.jpg",
            "size" : "contain"
        },

        {
            "type" : "paragraph",
            "content" : "Importantly, the Soya Outgrower Scheme is rooted in the United Nations Sustainable Development Goals (SDGs). It directly contributes to:"
        },

        {
            "type" : "list",
            "name" : "",
            "content" : [
                "SDG 1 (No Poverty) – by increasing rural incomes through agriculture;", 
                "SDG 2 (Zero Hunger) – by boosting food availability and nutritional diversity;",
                "SDG 13 (Climate Action) – by promoting climate-smart agricultural techniques and reducing unsustainable farming practices."
            ],
            "attrs" : {
                "bullets" : true
            }
        },


        {"type" : "spacer"},

        {
            "type" : "paragraph",
            "content" : "Speaking on behalf of the community, one of the elders, Mr. Yao Kumah E., expressed profound appreciation:"
        },

        {
            "type" : "quote",
            "preface" : "Speaking on behalf of the community, one of the elders, Mr. Yao Kumah E., expressed profound appreciation:",
            "content" : "This is not just about seeds and fertilizer – it’s about hope, it’s about empowerment. We thank Puzuri for remembering Segbale and Adaklu as a whole.",
            "by" : "Mr. Yao Kumah",
            "image" : null,
            "designation" : " Community Elder, Segbale - Adaklu"
        },

        {"type" : "spacer"},


        {
            "type" : "paragraph",
            "content" : "As the season unfolds, Segbale is expected to serve as a model for effective private-community partnership in agriculture. The success here will guide implementation across communities interested in the scheme, reinforcing Puzuri’s commitment to transforming agriculture in Ghana from the ground up."
        }
    ]
    },
    {
        "date": "2025-02-18",
        "title": "Puzuri, NSA, and Agri-Impact Conduct Impact Survey to Unlock the Full Potential of the HAPPY Project",
        "slug": "puzuri-nsa-and-agri-impact-conduct-impact-survey-to-unlock-the-full-potential-of-the-happy-project",
        "teaser": "Puzuri Group of Companies Limited continues to play a pivotal role in driving agricultural transformation through its involvement in the HAPPY Project.",
        "poster": "/news/images/outgrowers.jpg",
        "main_category": "News",
        "tags": [],
        "blocks" : [
         {
            "type" : "paragraph",
            "content" : "As part of efforts to assess the program’s impact and explore opportunities for expansion, Puzuri actively facilitated the Participant Impact Survey conducted by Agri-Impact, the Project Management Unit (PMU), in collaboration with the National Service Authority (NSA). The survey, held on February 13 and 14, 2025, focused on sampled Puzuri operational areas in the Sissala West District of the Upper West Region and the Mion and Tamale Metropolis District in the Northern Region, offering valuable insights into the project’s reach and effectiveness."
        },

        {
            "type" : "gallery",
            "content" : [
                {
                    "type" : "image",
                    "src" : "/news/ayawaso_one.jpg"
                },
                {
                    "type" : "image",
                    "src" : "/news/ayawaso_two.jpg"
                },
                {
                    "type" : "image",
                    "src" : "/news/ayawaso_three.jpg"
                }

            ]
        },


        {
            "type" : "paragraph",
            "content" : "During the survey, PMU representatives visited Puzuri’s large-scale agricultural sites, including Didjaw, Chirizang Farm Fields, Kayong Farm Fields, and Jimile Farm Fields, which collectively span thousands of hectares. These Fields showcased Puzuri’s significant investments in commercial farming, with operations featuring crop cultivation, livestock rearing, and aquaculture. Notably, the Jimile Farm boasts a 20,000-capacity poultry structure and a dam with a fish pond, highlighting the company’s vast but largely untapped agribusiness potential."
        },



        {
            "type" : "gallery",
            "content" : [
                {
                    "type" : "image",
                    "src" : "/news/ayawaso_one.jpg"
                },
                {
                    "type" : "image",
                    "src" : "/news/ayawaso_two.jpg"
                },
                {
                    "type" : "image",
                    "src" : "/news/ayawaso_three.jpg"
                }

            ]
        },




        {
            "type" : "paragraph",
            "content" : "Participants in the survey commended Puzuri for its commitment to empowering youth, women, and Persons with Disabilities (PWDs) through inclusive agribusiness initiatives. They acknowledged the company’s dedication to providing market linkages, training, and consistent monitoring, which have improved their farming practices. Despite the challenges of an unpredictable farming season, including droughts and difficulties accessing mechanized services, the survey demonstrated the resilience of Puzuri-supported farmers and their ability to adapt to evolving agricultural demands."
        },

        {
            "type" : "gallery",
            "content" : [
                {
                    "type" : "image",
                    "src" : "/news/ayawaso_one.jpg"
                },
                {
                    "type" : "image",
                    "src" : "/news/ayawaso_two.jpg"
                },
                {
                    "type" : "image",
                    "src" : "/news/ayawaso_three.jpg"
                }

            ]
        },



        {
            "type" : "paragraph",
            "content" : "The survey also highlighted broader industry challenges such as delayed farming cycles, rising labor costs, and limited access to farming equipment. These factors have impacted productivity, but with a reinforced commitment from stakeholders, there is a strong opportunity to enhance the effectiveness of the HAPPY Project. Puzuri continues to advocate for a comprehensive support package for beneficiaries, timely resource allocation, and expanded deployment of National Service Personnel (NSP) to strengthen operations."
        },

        {
            "type" : "gallery",
            "content" : [
                {
                    "type" : "image",
                    "src" : "/news/ayawaso_one.jpg"
                },
                {
                    "type" : "image",
                    "src" : "/news/ayawaso_two.jpg"
                },
                {
                    "type" : "image",
                    "src" : "/news/ayawaso_three.jpg"
                }

            ]
        },



        {
            "type" : "paragraph",
            "content" : "The findings of the Participant Impact Survey reaffirmed the importance of Puzuri’s role in the sector and the project’s potential to drive lasting change. With increased collaboration between NSA, PMU, and other partners, the HAPPY Project is poised to create even greater economic opportunities for young people and underserved communities in agribusiness. Puzuri remains dedicated to innovation and sustainable growth, ensuring that agriculture continues to be a viable and thriving sector for generations to come."
        }
    ]
},
{
    "date": "2024-11-08",
    "title": "Puzuri’s Executive Director Honored as Global Well-Respected CEO",
    "slug": "puzuris-executive-director-honored-as-global-well-respected-ceo",
    "teaser": "We are proud to announce that our esteemed Executive Director, Mr. Abdul-Rahaman Yahaya, has been awarded the title of Global Well-Respected CEO in Agro, Construction, and Social Impact Initiatives at the prestigious 2nd Edition of the Global Well-Respected CEO Awards, held in Dubai, UAE.",
    "poster": "/news/images/ceo_award_2.jpg",
    "main_category": "News",
    "tags": [],
    "blocks" : [


        {
            "type" : "paragraph",
            "content" : "This international event brought together renowned NGOs, global corporations, and industry leaders from various sectors, including agriculture, pharmaceuticals, construction, hospitality, logistics, fashion, fintech, and finance. The awards celebrated executives who have demonstrated exemplary leadership, vision, and commitment to creating positive societal impacts in their respective fields."
        },

        {
            "type" : "image",
            "src" : "/news/images/ceo_award.jpeg",
            "size" : "contain"
        },


        {
            "type" : "paragraph",
            "content" : "Due to his commitments, Mr. Yahaya was represented at the awards ceremony by Mr. Yamusah Abdallah, Marketing Director at Puzuri. In his acceptance speech, Mr. Abdallah expressed heartfelt gratitude on behalf of the Executive Director, highlighting Mr. Yahaya’s visionary leadership, commitment to innovation, and dedication to social impact. Mr. Abdallah emphasized, “This award is a testament to Mr. Yahaya’s visionary leadership, strategic mindset, and the passion he brings to every aspect of our work. His dedication to giving back to our communities through CSR initiatives, especially in Northern Ghana, highlights his compassion and commitment to making a meaningful impact.”"
        },


        {
            "type" : "image",
            "src" : "/news/images/ceo_award_3.jpg",
            "size" : "contain"
        },


        {
            "type" : "paragraph",
            "content" : "This latest accolade is part of a series of recognitions that Puzuri Group of Companies has received this year. Just three months ago, Puzuri was awarded as the Best Multidivisional Business in Ghana, marking yet another significant milestone in the company’s journey. Mr. Yahaya’s award underscores the collective effort, resilience, and dedication of Puzuri’s team, partners, and stakeholders."
        },

        {
            "type" : "gallery",
            "content" : [
                {
                    "type" : "image",
                    "src" : "/news/images/ceo_award_4.jpg"
                },
                {
                    "type" : "image",
                    "src" : "/news/images/ceo_award_5.jpg"
                }

            ]
        },
        

        {
            "type" : "paragraph",
            "content" : "Puzuri Group of Companies extends its gratitude to the Global Well-Respected CEO Awards organizers for acknowledging Mr. Yahaya’s efforts and achievements. This award reinforces Puzuri’s commitment to excellence, innovation, and social impact, setting a strong foundation for future achievements. Puzuri! Cultivating the Future!"
        }
    ]
},
{
    "date": "2024-09-26",
    "title": "Puzuri Group of Companies Wins Best in Multi-Divisional Enterprises Award at Northern Ghana Business Merit Awards 2024",
    "slug": "puzuri-group-of-companies-wins-best-in-multi-divisional-enterprises-award-at-northern-ghana-business-merit-awards-2024",
    "teaser": "Puzuri Group of Companies Limited has been honored with the prestigious Best in Multi-Divisional Enterprises award at the Northern Ghana Business Merit Awards 2024 on September 13, 2024, at the Modern City Hotel in Tamale.",
    "poster": "/news/images/best_mutli_award.jpg",
    "main_category": "News",
    "tags": [],
    "blocks" : [

        {
            "type" : "paragraph",
            "content" : "This recognition celebrates our commitment to excellence and our impact across the various sectors in which we operate, including agriculture, construction, logistics, and community development"
        },



        {
            "type" : "paragraph",
            "content" : "At Puzuri, our work spans several industries, from agriculture to construction and logistics. Through our initiatives, we are not only building strong businesses but also aligning our efforts with the United Nations’ Sustainable Development Goals (SDGs), especially in promoting decent work and economic growth, reducing inequalities, and creating sustainable communities. This award motivates us to continue making an impact that uplifts our communities and contributes to the broader global goals.”"
        },

        {
            "type" : "gallery",
            "content" : [
                {
                    "type" : "image",
                    "src" : "/news/images/best_mutli_award_1.jpg"
                },
                {
                    "type" : "image",
                    "src" : "/news/images/best_mutli_award_2.jpg"
                }

            ]
        },
        {
            "type" : "paragraph",
            "content" : "The Northern Ghana Business Merit Awards, organized by The Business Executive Media Group, recognizes businesses and individuals who have demonstrated outstanding performance and contributed significantly to the socio-economic growth of the northern regions. Being selected for this award reflects our dedication to driving sustainable development, innovation, and positive change in Northern Ghana and beyond."
        },

        {
            "type" : "paragraph",
            "content" : "We would like to extend our heartfelt thanks to our hardworking team, partners, and the communities we serve for their continued support. This award is a testament to the collective effort that has propelled Puzuri forward, and we are more committed than ever to empowering growth and building a brighter future across all industries."
        }
    ]
},
{
    "date": "2024-09-26",
    "title": "Puzuri Executive Director Honored as Africa’s Most Respected CEO in Agriculture",
    "slug": "puzuri-executive-director-honored-as-africas-most-respected-ceo-in-agriculture",
    "teaser": "Mr. Abdul-Rahaman Yahaya, the Executive Director of Puzuri Group of Companies Limited has been honored as one of Africa’s Most Respected CEOs (Agriculture Sector) at the prestigious 4th edition of the Africa’s Most Respected CEOs Award, organized by The Business Executive Group (TBE)",
    "poster": "/news/images/agric_award.jpg",
    "thumbnail" : "/news/thumbnails/agro_award.jpg",
    "main_category": "News",
    "tags": [],
    "blocks" : [

        {
            "type" : "paragraph",
            "content" : " The award ceremony, held at The Concord Hotel in Nairobi, Kenya, on August 1, 2024 celebrated leaders who have made significant contributions to their industries and fostered cross-border trade and investment across Africa."
        },



        {
            "type" : "paragraph",
            "content" : "The Business Executive Group aims to recognize individuals who have demonstrated exemplary leadership and commitment to the continent’s economic growth. This year’s theme, “Energizing the African Corporate Community to Revolutionize Industrialization,” underscores the importance of visionary leadership in driving industrialization and sustainable development in Africa."
        },

        
        {
            "type" : "paragraph",
            "content" : "In his acceptance speech, the Executive Director expressed gratitude to the organizers, judges, and his team, emphasizing that the award is a testament to their collective hard work and vision. He highlighted the critical role of agriculture in Africa’s economy and the need for innovative and sustainable practices to tackle challenges like climate change, food security, and market access. He also called for fostering partnerships to build resilient food systems, create jobs, and ensure food security."
        },

        {
            "type" : "paragraph",
            "content" : "The recognition of the Executive Director as one of Africa’s Most Respected CEOs highlights the significant contributions of Puzuri Group of Companies to the agricultural sector. Puzuri Group of Companies Limited is renowned for its innovative outgrower and ingrower schemes, youth training programs, urban backyard farming initiatives, and advancements in aquaponics and livestock rearing. The company’s partnerships with organizations such as SNV, SARI, NSS, BioAquaGardens Ltd, and ICOUR have been instrumental in promoting sustainable agricultural practices and technological innovation."
        },
        {
            "type" : "paragraph",
            "content" : "This award not only brings honor to the Executive Director and the Company but also underscores the importance of the Sustainable Development Goals (SDGs) in Puzuri’s operations. By focusing on SDGs such as zero hunger, no poverty, decent work and economic growth, industry innovation and infrastructure, and climate action, Puzuri is contributing to the overall development and well-being of communities across Africa."
        },
        {
            "type" : "paragraph",
            "content" : "The Business Executive Group (TBE) is a prominent organization dedicated to promoting business excellence and fostering cross-border trade and investment in Africa. Through initiatives like the Africa’s Most Respected CEOs Award, TBE aims to recognize and celebrate the achievements of outstanding leaders who are driving economic growth and development on the continent."
        }
    ]
},
{
    "date": "2024-06-28",
    "title": "Puzuri and NSS Partner to Train 1790 Outgrowers on Good Agronomic Practices for Soya Production",
    "slug": "puzuri-and-nss-partner-to-train-1000-outgrowers-on-good-agronomic-practices-for-soya-production",
    "teaser": "In a concerted effort to bolster agricultural productivity and sustainability, Puzuri has partnered with the National Service Scheme (NSS) to train 1790 outgrowers from 10 communities across three districts in Northern Ghana on Good Agronomic Practices (GAP) for soya production.",
    "poster": "/news/images/nss_news_10.jpg",
    "thumbnail" : "/news/thumbnails/nss_news_thumb.jpg",
    "main_category": "News",
    "tags": [],
    "blocks" : [

        {
            "type" : "paragraph",
            "content" : "This initiative, part of a broader capacity-building program, aims to equip farmers with the knowledge and skills necessary to start the 2024/2025 farming season effectively. By focusing on GAP, the training seeks to enhance the quality and yield of soya crops, contributing to improved livelihoods and food security in the region. These trainings were held in the Mion, Yendi and Tamale Metropolitan Districts from 13th to 17th June 2024."
        },


        {
            "type" : "gallery",
            "content" : [
                {
                    "type" : "image",
                    "src" : "/news/images/nss_news_9.jpg"
                },
                {
                    "type" : "image",
                    "src" : "/news/images/nss_news_8.jpg"
                },
                {
                    "type" : "image",
                    "src" : "/news/images/nss_news_7.jpg"
                }

            ]
        },



        {
            "type" : "paragraph",
            "content" : "The comprehensive training program covered critical aspects of soya production, including land preparation, seed selection and sowing processes, weed control, harvesting techniques, yield improvement strategies, prevention of post-harvest losses, storage, processing, and marketing. These topics were expertly delivered by the resource team, which included Mr. Abdul Rashid Mohammed, the Director of Agriculture at Puzuri, Dr. Mrs. Zotorvie, and Mr. Boateng from NSS. Their insights were pivotal in ensuring that the farmers received practical and actionable advice to optimize their farming practices."
        },

        
        {
            "type" : "paragraph",
            "content" : "In addition to the resource persons, the training session was graced by the presence of Mr. Kpolu, Northern Regional Director for NSS, and the Director of Marketing at Puzuri. Their attendance underscored the importance of the initiative and the collaborative effort between Puzuri and NSS to support local farmers. This partnership is a testament to both organizations’ commitment to sustainable agricultural development and capacity building."
        },


        {
            "type" : "gallery",
            "content" : [
                {
                    "type" : "image",
                    "src" : "/news/images/nss_news_6.jpg"
                },
                {
                    "type" : "image",
                    "src" : "/news/images/nss_news_5.jpg"
                },
                {
                    "type" : "image",
                    "src" : "/news/images/nss_news_4.jpg"
                }

            ]
        },


        {
            "type" : "paragraph",
            "content" : "This training aligns with several United Nations Sustainable Development Goals (SDGs), including SDG 1 (No Poverty), SDG 2 (Zero Hunger), and SDG 8 (Decent Work and Economic Growth). By enhancing farmers’ knowledge and practices, the initiative aims to increase agricultural productivity and income, thereby reducing poverty and hunger. Moreover, the focus on sustainable farming practices contributes to SDG 12 (Responsible Consumption and Production) by promoting efficient use of resources and minimizing post-harvest losses."
        },
        {
            "type" : "paragraph",
            "content" : "The collaboration between Puzuri and NSS exemplifies the power of partnerships in achieving sustainable development. By equipping farmers with essential skills and knowledge, this initiative not only improves soya production but also strengthens the agricultural sector as a whole. As Puzuri continues to champion sustainable agriculture, this training program marks a significant step towards a more productive and resilient farming community in Northern Ghana."
        },



        {
            "type" : "gallery",
            "content" : [
                {
                    "type" : "image",
                    "src" : "/news/images/nss_news_3.jpg"
                },
                {
                    "type" : "image",
                    "src" : "/news/images/nss_news_2.jpg"
                },
                {
                    "type" : "image",
                    "src" : "/news/images/nss_news_1.jpg"
                }

            ]
        },
        {
            "type" : "paragraph",
            "content" : "As we look ahead to the 2024/2025 farming season, Puzuri remains committed to supporting our farmers and fostering sustainable agricultural practices. Through continuous training and capacity-building efforts, we aim to drive agricultural innovation and ensure a prosperous future for our farming communities."
        }
    ]
}

]